{
  "contexts": [
    "La Revolución Francesa fue un proceso social y político que se desarrolló en Francia entre 1789 y 1799. Se caracterizó por la caída de la monarquía absoluta, el fin de los privilegios de la nobleza y el clero, y la proclamación de los derechos del hombre y del ciudadano. Uno de los acontecimientos más importantes fue la toma de la Bastilla el 14 de julio de 1789, que simbolizó el inicio de la lucha popular contra el Antiguo Régimen. Este proceso abrió el camino para la aparición de Napoleón Bonaparte en la política europea.",
    
    "La Revolución Industrial comenzó en Inglaterra a finales del siglo XVIII. La invención de la máquina de vapor y el desarrollo de la industria textil fueron factores clave. Provocó el crecimiento de las ciudades, la migración del campo a la ciudad y el surgimiento de una nueva clase trabajadora. Sin embargo, también generó explotación laboral y profundizó desigualdades sociales.",
    
    "La Primera Guerra Mundial ocurrió entre 1914 y 1918, enfrentando a las Potencias Centrales (Alemania, Austria-Hungría y sus aliados) contra la Triple Entente (Reino Unido, Francia, Rusia y, más tarde, Estados Unidos). El conflicto comenzó tras el asesinato del archiduque Francisco Fernando en Sarajevo. Terminó con la firma del Tratado de Versalles en 1919, que impuso duras sanciones a Alemania.",
    
    "La Segunda Guerra Mundial se desarrolló entre 1939 y 1945, iniciada con la invasión alemana a Polonia bajo el mando de Adolf Hitler. Fue un conflicto global que enfrentó a las potencias del Eje (Alemania, Italia y Japón) contra los Aliados (Reino Unido, Estados Unidos, la Unión Soviética y otros). Terminó en 1945 con la derrota del Eje y marcó el inicio de la Guerra Fría.",
    
    "Las civilizaciones antiguas tuvieron un papel clave en la historia universal. En Egipto, los faraones construyeron pirámides como tumbas monumentales, y el río Nilo fue esencial para la agricultura. En Grecia, florecieron la filosofía, la democracia y la cultura clásica, con figuras como Sócrates, Platón y Aristóteles. En Roma, se desarrolló un vasto imperio caracterizado por sus conquistas militares, su derecho y sus construcciones, que influyeron en gran parte de Europa durante siglos."
  ]
}
